{
  "slug": "addendum-d",
  "title": "Resources & Research Database",
  "content": "A curated collection of the most recent and impactful research papers, policy briefs, and training courses regarding AI in the media, updated for the 2025 academic year.\n## 1. Selected Research on the Impact of AI on Media\n- The State of The Bots (Q1 2025). \"RAG bot scrapes now exceed Training bot scrapes.\" A critical report on how AI bots are aggressively scraping news publisher data, often ignoring robots.txt protocols. https://www.scribd.com/document/944556714/TollBit-State-of-the-Bots-Q1-2025\n- AI Across America: Attitudes On AI Usage (August 2025). A massive survey revealing that 50% of US adults now use AI tools, with significant data on public trust and fear of job displacement. https://www.chip50.org/reports/ai-across-america-attitudes-on-ai-usage-job-impact-and-federal-regulation\n- Generative AI Outlook Report (2025). European Commission JRC. Maps the path for AI policy and innovation in Europe, warning that without ethical oversight, the EU risks falling behind. https://digital-strategy.ec.europa.eu/en/news/generative-ai-set-transform-eu-economy-requires-further-policy-action\n- Artificial Intelligence in Eastern Africa Newsrooms (March 2025) – CIPESA. An analysis of perceived prevalence, ethics, and impact of AI on media freedom in Ethiopia, Kenya, Tanzania, and Uganda. https://www.eaeditors.org/publications\n- Generative AI & Journalism: Content, Perceptions, and Audiences (Feb 2025) – RMIT University. A study across seven countries examining how audiences perceive AI-generated news content and the transparency paradox.\n- Generative AI in Journalism: The Evolution of Newswork (April 2024) – Associated Press. The definitive report on how AP and other major newsrooms are adapting ethical guidelines for the generative age. https://www.trust.org/wp-content/uploads/2025/01/TRF-Insights-Journalism-in-the-AI-Era.pdf\n- Hallucination Mitigation Using Agentic AI (Jan 2025). Technical research on using multiple AI agents to check each other's work to reduce \"hallucinations\". https://arxiv.org/abs/2501.13946\n## 2. Policy, Ethics & Legal Frameworks\n- AI in the Work of an Attorney-at-Law (2025). Recommendations on how legal professionals (and by extension, investigative journalists dealing with legal data) should use AI tools securely.\n- M20 Policy Brief 4: AI, Africa and the G20 (July 2025). A critique of the \"power concentration\" of AI in the Global North and recommendations for protecting African data sovereignty. https://media20.org/2025/07/10/m20-policy-brief-4-power-politics-and-economics-ai-africa-and-the-g20/\n- The Paris Charter on AI and Journalism (Nov 2023). A foundational ethical document signed by 16 partner organizations (RSF) defining principles for AI in news. https://rsf.org/en/paris-charter-ai-and-journalism\n- Exposing Technology-Facilitated Gender-Based Violence (2023) – UNESCO. How generative AI is being weaponized to harass women journalists and public figures. https://www.unesco.org/en/articles/your-opinion-doesnt-matter-anyway\n## 3. Online Courses & Educational Resources\n- Google News Initiative: Pinpoint & Data Tools. Using AI to search through thousands of PDFs and handwritten documents. https://newsinitiative.withgoogle.com/resources/trainings/google-ai-tools/\n- MIT: Introduction to Deep Learning (6.S191). A technical deep dive for those wanting to understand the architecture behind the models. https://www.youtube.com/watch?v=alfdI7S6wCY\n## 4. Tools & Open Source Repositories\n- Hugging Face: Journalists' Toolkit. Finding open-source models to run locally for privacy. https://huggingface.co/spaces/JournalistsonHF/ai-toolkit\n- Journalism Cloud Alliance (OCCRP/GFMD). Shared infrastructure for investigative newsrooms to lower cloud costs and increase security. https://gfmd.info/cloud-alliance/\n## 5. Organisations Leading AI Innovation in Global South\n- Centre for Information Integrity in Africa (CINIA). Combatting disinformation and safeguarding democratic values in the African digital space. https://cinia.africa/\n- Vambo AI. Bridging the language gap with AI solutions for indigenous African languages. https://www.vambo.ai/\n- SADiLaR (South African Centre for Digital Language Resources). Creating digital resources for under-resourced languages. https://sadilar.org/en/\n- Lelapa AI. \"AI for Africans, by Africans\" building resource-efficient language models. https://lelapa.ai/\n## 6. Podcasts & Multimedia\n- Reuters Institute: Digital News Report 2025 Launch (Africa). Discussion on trust, AI usage, and news consumption trends. https://www.youtube.com/watch?v=LM9JwQ1jSbM\n- Inside the FT's AI-Powered Story Finding. How the Financial Times uses AI not just to write, but to find stories in data. https://medium.com/ft-product-technology/inside-the-fts-ai-powered-story-finding-efe6d154f20b\n## 7. Legacy Research (Foundational Reading)\n- New Powers, New Responsibilities (2019) – LSE Polis. The seminal global survey that launched the JournalismAI initiative. https://www.journalismai.info/research/2019-new-powers-new-responsibilities\n- News Automation: The Rewards, Risks and Realities (2019) – WAN-IFRA. An early but relevant guide to the practicalities of \"robot journalism.\" https://wan-ifra.org/insight/report-news-automation-the-rewards-risks-and-realities-of-machine-journalism/\n- The Next Wave of Disruption (2021) – IMS. Emerging market media use of AI. https://www.mediasupport.org/publication/the-next-wave-of-disruption-emerging-market-media-use-of-artificial-intelligence-and-machine-learning"
}