{
  "slug": "addendum-a",
  "title": "Caution List: Tools with Significant Risks",
  "content": "1) The Transcription Trap\nIn the high-pressure environment of a newsroom, the transcription of interviews is a bottleneck. For decades, this was a manual, labour-intensive process. The arrival of AI has promised to reclaim hours of productivity. However, this convenience (in certain cases and with certain tools) comes with a severe hidden cost: the loss of custody over source data.\n## Otter.ai\nTool Overview: Otter.ai is the market leader in consumer AI transcription, known for its \"OtterPilot\" feature that automatically joins meetings to record and transcribe conversations.\nWhat is the risk? The primary risk with Otter.ai is its architecture of aggressive data ingestion. The \"OtterPilot\" bot can join meetings automatically if calendar permissions are granted, potentially recording off-the-record pre-ambles or conversations where not all parties have consented. In 2024 and 2025, the company faced class-action litigation in the United States alleging violations of wiretapping laws, specifically regarding the non-consensual recording of voice biometrics. The data resides on US-based servers, subject to foreign subpoenas. And more critically, the privacy policy allows for the use of audio data to train the company's AI models. This means a whistleblower's voice is processed, tokenized, and potentially retained within the model's training corpus.\n2) The Writing Process\n## Grammarly\nTool Overview: A cloud-based writing assistant that checks spelling, grammar, and tone. Grammarly functions by transmitting every keystroke in an active text field to its cloud servers for analysis. For a journalist investigating state corruption or organized crime, this is an operational security failure. The text of a draft investigation, containing names, dates, and allegations, is exposed to Grammarly's infrastructure before it is even published.\nWhat is the risk? The 2024–2025 integration of generative AI features increases the likelihood that user data feeds into broader language models. Universities and corporations with high security requirements often ban Grammarly for this exact reason.\n3) Visual Journalism\nVisual storytelling is dominated by short-form video (TikTok, Reels). The tools required to compete in this algorithmic arena—offering auto-captions, filters, and snappy transitions are predominantly mobile-first and data-hungry. The risk here is biometric harvesting.\n## CapCut\nTool Overview: The most popular mobile video editor, owned by ByteDance (parent of TikTok).\nWhat is the risk? CapCut is a consumer video-editing application whose data collection and licensing practices have raised significant privacy and surveillance concerns among regulators and legal commentators. In 2024-2025, it faced class-action lawsuits in the US (Illinois) for violating the Biometric Information Privacy Act (BIPA). The lawsuits allege that CapCut collects biometric identifiers, including facial and voice data, as well as device and location information, without obtaining consent required under Illinois law. CapCut updated its Terms of Service on June 12, 2025, which have drawn legal and public criticism because they grant broad rights to user-generated content, including rights to use, edit, reproduce, and exploit content worldwide, with implications for biometric features (these include facial recognition and voice patterns). This update expanded the scope of what CapCut can legally do with uploaded content without separate user consent. For a journalist in the CEE region, the geopolitical risk is acute. ByteDance is subject to Chinese security laws.\n4) The Communication Infrastructure\nFor certain parts of the world, Telegram is not just a messenger app, it is the internet. It is the primary source of news, alerts, and social organization. However, for a journalist, relying on it for private communication is a dangerous fallacy.\n## Telegram\nTool Overview: The fatal flaw of Telegram is that Cloud Chats are not End-to-End Encrypted by default. Telegram holds the decryption keys. This means the company, and by extension, any entity that can coerce the company, can read the messages. Only \"Secret Chats\" are true end-to-end encrypted (E2EE) and must be manually enabled.\n## The Better Alternative: Signal\nTool Overview: An encrypted messenger owned by a non-profit foundation. Signal minimizes metadata retention. Even if subpoenaed, Signal can typically only produce the date of account creation and the date of last login. It is the gold standard for contact."
}