{
  "slug": "glossary",
  "title": "Glossary of AI in Journalism",
  "content": "## Artificial Intelligence (AI)\nComputer systems designed to perform tasks that normally require human judgment, such as recognising speech, identifying patterns or generating text. AI does not understand meaning, but instead it predicts likely outputs based on data.\n## Algorithm\nA set of rules or instructions a computer follows to perform a task. In journalism, algorithms often determine how content is processed, ranked or generated.\n## Large Language Model (LLM)\nAn AI system trained on vast amounts of text to understand, generate and analyze language. LLMs predict what word is likely to come next, based on patterns, not truth. Powers tools for writing, summarization, translation, research assistance, and chat interfaces.\n## Hallucination\nWhen an AI system produces information that sounds confident but is false or invented. Hallucinations are a known limitation, not a rare bug.\n## Training Data\nThe data used to teach an AI system how to behave. Biases and gaps in training data are reflected in outputs.\n## Open Source\nSoftware whose code is publicly available and can be inspected, modified and run locally. Often safer and more transparent for journalism.\n## Cloud-Based Tool\nA tool that processes data on external servers rather than on the user's device. This can create security and privacy risks.\n## Local Processing\nRunning software entirely on a user's own computer, without sending data to the internet. Often preferred for sensitive material.\n## Metadata\nInformation about data, such as time, location, device type or author. Metadata can expose sources even when content seems anonymous.\n## Retrieval-Augmented Generation (RAG)\nA technique where an AI model retrieves information from specific documents before generating an answer. Improves accuracy and reduces hallucinations when working with trusted newsroom data. Useful for private archives.\n## Automatic Speech Recognition (ASR)\nTechnology that converts spoken audio into written text. Used by journalists to transcribe interviews, press briefings, podcasts and field recordings at speed and scale.\n## Whisper\nAn open-source speech-to-text model developed by OpenAI, known for high accuracy across accents, noisy audio and multiple languages. Widely used as the underlying engine in transcription tools for journalism, podcasts and interviews.\n## Speech-to-Text\nA category of AI systems that convert spoken language into written text. Used by journalists to rapidly turn interviews, meetings, and audio recordings into editable transcripts.\n## Graphics Processing Unit (GPU)\nA specialized processor designed to handle large numbers of calculations in parallel. AI tools use GPUs to transcribe audio, generate text, or process images much faster than standard CPUs.\n## Command Line Interface (CLI)\nA text-based way of interacting with software by typing commands instead of clicking buttons. Common in advanced AI workflows, but usually unnecessary for everyday newsroom use.\n## End-to-End Encryption (E2EE)\nA security method where only the sender and recipient can read the content of messages or files. Critical for protecting sources, sensitive communications and investigative material.\n## Integrated Development Environment (IDE)\nA software workspace that combines code editing, testing, and debugging in one place. Used mainly by developers building or customizing AI tools, not by most journalists directly.\n## Optical Character Recognition (OCR)\nTechnology that converts scanned documents or images of text into machine-readable text. Essential for working with PDFs, court records, archival material, and photographed documents.\n## Open-Source Intelligence (OSINT)\nInformation gathered from publicly available sources such as social media, websites, and databases. Used in investigations, verification, and background research without relying on confidential sources.\n## Text-to-Speech (TTS)\nTechnology that converts written text into spoken audio. Used for accessibility, audio articles, voice previews and rapid multilingual publishing.\n## Virtual Private Network (VPN)\nA tool that encrypts internet traffic and masks a user's location. Important for journalist safety, privacy, and working in high-risk or censored environments.\n## Stable Diffusion\nAn AI system that generates images from written descriptions, such as illustrations, photos, or visual concepts. It can be used on personal computers or through online services, giving users more control over how images are created and where the data is processed.\n## Open-Weight Models\nAI models that anyone can download and run themselves, rather than only accessing through a company's website or app. This means organizations can use the model on their own computers or servers, with more control over privacy, cost and how the tool behaves.\n## RSS Feeds\nA simple way for websites to automatically send updates when new content is published. Used by journalists to monitor multiple news sites or government pages without visiting each one manually.\n## APIs (Application Programming Interfaces)\nA structured way for one system to share data directly with another system. Used in newsrooms to automatically pull information such as election results, weather data or public records into tools and workflows."
}