{
  "slug": "how-to-use",
  "title": "How to Use This Toolkit",
  "content": "This toolkit is designed as a teaching companion. It assumes that lecturers are working with students who may be curious, sceptical or already experimenting independently with AI tools. Rather than organising teaching around tools themselves, the toolkit is structured around journalistic problems. Each tool cluster begins with a real newsroom challenge, for example, handling multilingual interviews, verifying social media content, or analysing messy government data. Tools are introduced only as responses to these problems, not as ends in themselves.\nFor teaching purposes, it is important to demystify AI early. Artificial Intelligence is not a single system and it does not \"think.\" It is a collection of techniques that recognise patterns in data and generate outputs based on probability. In journalism, this means AI is very good at handling scale (large volumes of text, audio, images or data) and very poor at understanding meaning, intent, harm or truth. This imbalance is central to how it should be taught.\nThroughout the toolkit, lecturers are encouraged to slow students down rather than speed them up. Every tool is accompanied by a Cost Difficulty Invasiveness (CDI) score, which helps students understand trade-offs. A tool that is easy to use may expose sensitive data. A free tool may monetize user content. A powerful tool may quietly train on journalistic work. These considerations are treated as editorial decisions, not technical details.\nA central concept used throughout the toolkit is the Time Dividend. AI saves time, but time saved is not neutral. If reclaimed time could be used to simply produce more content faster and then journalistic quality erodes. The toolkit therefore pairs each tool with how time will be saved and then suggestions for how saved time should be reinvested into deeper reporting, verification, source development or audience engagement. This reinforces the idea that AI's value lies in strengthening journalism, not hollowing it out.\nUsing the term AI can be fraught at the best of times. It is unavoidable to use it throughout this toolkit, but using terms like \"an AI\" often makes people think of AI as a sentient agent or a conscious being. It also implies there's one discrete object being called AI, which isn't accurate. When talking to your students, try to make sure that all references position AI as a field of practice or as a specific tool, not as a grander intelligence. AI works with patterns, not meaning, and it is important to stress that.\nFinally, the toolkit is intentionally comparative. Wherever possible, commercial tools are shown alongside open-source or locally run alternatives. This allows students to understand what convenience buys them (and what it costs them) and reduces dependency on a small number of global platforms. In regions where resources are limited or security risks are high, this comparative approach is essential."
}