{
  "slug": "introduction",
  "title": "Introduction",
  "content": "We are at an inflection point in journalism education. By 2025, the challenge is no longer access to Artificial Intelligence, but the governance of it. Research indicates that over 42% of journalists are already using \"Shadow AI\" (unapproved tools used without editorial oversight) to write headlines, transcribe interviews, and generate code.\nYour students are likely already using AI tools. The danger is that they are using them blindly. They could be feeding sensitive data into opaque models, risking source confidentiality and relying on \"black box\" algorithms. This toolkit is designed to help you elevate your teaching from simple \"tool training\" to critical AI literacy. It does not merely list software. Here our goal is to train journalists who are not just users of technology, but auditors of it.\nArtificial Intelligence is already embedded in journalism, whether it is formally acknowledged or not. Students and early-career journalists are using AI systems to transcribe interviews, summarise documents, translate material, write code, generate visuals, and search for information. The question facing journalism education is therefore not whether AI should be introduced, but how it should be understood, governed and used responsibly.\n## In the newsroom, AI is currently used in six broad ways\n1) It is used to support reporting and research by transcribing interviews, translating material, and searching large document collections.\n2) It is used in verification and investigations to analyze images and videos, track changes to official sources and identify networks of actors.\n3) It is used in writing and summarising long texts, cleaning data and assisting with drafting.\n4) It is used in audio, video and visual storytelling to improve accessibility and reach audiences in new formats.\n5) It is used in security and source protection through encryption, document sanitization and local processing.\n6) It is increasingly used to build small, custom tools and this allows journalists to create their own scrapers, calculators, or explainers without relying on external vendors."
}